RTEMS/rtems/bsps/arm/imxrt/mcux-sdk/drivers/enet/fsl_enet.c
#if defined(FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL) && FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL
            if (buffCfg->rxMaintainEnable)
            {
                /* Invalidate rx buffers before DMA transfer data into them. */
                DCACHE_InvalidateByRange(rxBuffer, ((uint32_t)rxBdNumber * rxBuffSizeAlign));
            }
#endif /* FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL */

            for (count = 0; count < rxBdNumber; count++)
            {
                /* Set data buffer and the length. */
                curBuffDescrip->length = 0;
                if (config->rxBuffAlloc == NULL)
                {
                    curBuffDescrip->buffer = (uint32_t)(rxBuffer + (uintptr_t)count * rxBuffSizeAlign);
                    /* Initializes the buffer descriptors with empty bit. */
                    curBuffDescrip->control = ENET_BUFFDESCRIPTOR_RX_EMPTY_MASK;
                }

                /* Sets the last buffer descriptor with the wrap flag. */
                if (count == (rxBdNumber - 1U))
                {
                    curBuffDescrip->control |= ENET_BUFFDESCRIPTOR_RX_WRAP_MASK;
                }

#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
                if (0U != (config->interrupt & mask))
                {
                    /* Enable receive interrupt. */
                    curBuffDescrip->controlExtend1 |= ENET_BUFFDESCRIPTOR_RX_INTERRUPT_MASK;
                }
                else
                {
                    curBuffDescrip->controlExtend1 = 0;
                }
#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */
                /* Increase the index. */
                curBuffDescrip++;
            }
        }
        buffCfg++;
    }
}

/*!
 * brief Allocates all Rx buffers in BDs.
 */
static status_t ENET_RxBufferAllocAll(ENET_Type *base, enet_handle_t *handle)
{
    assert(handle->rxBuffAlloc != NULL);

    volatile enet_rx_bd_struct_t *curBuffDescrip;
    enet_rx_bd_ring_t *rxBdRing;
    uintptr_t buffer;
    uint16_t ringId;
    uint16_t index;

    /* Allocate memory for all empty buffers in buffer descriptor */
    for (ringId = 0; ringId < handle->ringNum; ringId++)
    {
        assert(handle->rxBdRing[ringId].rxBdBase != NULL);

        rxBdRing       = &handle->rxBdRing[ringId];
        curBuffDescrip = rxBdRing->rxBdBase;
        index          = 0;

        do
        {
            buffer = (uintptr_t)(uint8_t *)handle->rxBuffAlloc(base, handle->userData, ringId);
            if (buffer == 0U)
            {
                ENET_RxBufferFreeAll(base, handle);
                return kStatus_ENET_InitMemoryFail;
            }
            assert((uint64_t)buffer + handle->rxBuffSizeAlign[ringId] - 1U <= UINT32_MAX);

#if defined(FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL) && FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL
            if (handle->rxMaintainEnable[ringId])
            {
                /* Invalidate cache in case any unfinished cache operation occurs. */
                DCACHE_InvalidateByRange(buffer, handle->rxBuffSizeAlign[ringId]);
            }
#endif /* FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL */
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            buffer = MEMORY_ConvertMemoryMapAddress(buffer, kMEMORY_Local2DMA);
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
            curBuffDescrip->buffer = (uint32_t)buffer;
            curBuffDescrip->control |= ENET_BUFFDESCRIPTOR_RX_EMPTY_MASK;

            /* Increase the buffer descriptor, if it's the last one, increase to first one of the ring. */
            index          = ENET_IncreaseIndex(index, rxBdRing->rxRingLen);
            curBuffDescrip = rxBdRing->rxBdBase + index;
        } while (index != 0U);
    }
    return kStatus_Success;
}

/*!
 * brief Frees all Rx buffers in BDs.
 */
static void ENET_RxBufferFreeAll(ENET_Type *base, enet_handle_t *handle)
{
    assert(handle->rxBuffFree != NULL);

    uint16_t index;
    enet_rx_bd_ring_t *rxBdRing;
    volatile enet_rx_bd_struct_t *curBuffDescrip;
    uintptr_t buffer;
    uint16_t ringId;

    for (ringId = 0; ringId < handle->ringNum; ringId++)
    {
        assert(handle->rxBdRing[ringId].rxBdBase != NULL);

        rxBdRing       = &handle->rxBdRing[ringId];
        curBuffDescrip = rxBdRing->rxBdBase;
        index          = 0;

        /* Free memory for all buffers in buffer descriptor */
        do
        {
            if (curBuffDescrip->buffer != 0U)
            {
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
                buffer = MEMORY_ConvertMemoryMapAddress(curBuffDescrip->buffer, kMEMORY_DMA2Local);
#else
                buffer = curBuffDescrip->buffer;
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
                handle->rxBuffFree(base, (void *)(uint8_t *)buffer, handle->userData, ringId);
                curBuffDescrip->buffer = 0;
                /* Clears status. */
                curBuffDescrip->control &= ENET_BUFFDESCRIPTOR_RX_WRAP_MASK;
            }

            /* Increase the buffer descriptor, if it's the last one, increase to first one of the ring. */
            index          = ENET_IncreaseIndex(index, rxBdRing->rxRingLen);
            curBuffDescrip = rxBdRing->rxBdBase + index;
        } while (index != 0U);
    }
}

/*!
 * brief Activates frame reception for specified ring.
 *
 * This function is to active the enet read process for specified ring.
 * note This must be called after the MAC configuration and
 * state are ready. It must be called after the ENET_Init() and
 * ENET_Ptp1588Configure(). This should be called when the ENET receive required.
 *
 * param base  ENET peripheral base address.
 * param ringId The ring index, range from 0 ~ (FSL_FEATURE_ENET_INSTANCE_QUEUEn(x) - 1).
 */
static inline void ENET_ActiveReadRing(ENET_Type *base, uint8_t ringId)
{
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_INSTANCE_QUEUEn(base));

    /* Ensure previous data update is completed with Data Synchronization Barrier before activing Rx BD. */
    __DSB();

    /* Actives the receive buffer descriptor. */
    switch (ringId)
    {
        case kENET_Ring0:
            base->RDAR = ENET_RDAR_RDAR_MASK;
            break;
#if FSL_FEATURE_ENET_QUEUE > 1
        case kENET_Ring1:
            base->RDAR1 = ENET_RDAR1_RDAR_MASK;
            break;
        case kENET_Ring2:
            base->RDAR2 = ENET_RDAR2_RDAR_MASK;
            break;
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
        default:
            assert(false);
            break;
    }
}

/*!
 * brief Activates frame sending for specified ring.
 * note This must be called after the MAC configuration and
 * state are ready. It must be called after the ENET_Init() and
 * this should be called when the ENET receive required.
 *
 * param base  ENET peripheral base address.
 * param ringId The descriptor ring index, range from 0 ~ (FSL_FEATURE_ENET_INSTANCE_QUEUEn(x) - 1).
 *
 */
static void ENET_ActiveSendRing(ENET_Type *base, uint8_t ringId)
{
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_INSTANCE_QUEUEn(base));

    volatile uint32_t *txDesActive = NULL;

    /* Ensure previous data update is completed with Data Synchronization Barrier before activing Tx BD. */
    __DSB();

    switch (ringId)
    {
        case kENET_Ring0:
            txDesActive = &(base->TDAR);
            break;
#if FSL_FEATURE_ENET_QUEUE > 1
        case kENET_Ring1:
            txDesActive = &(base->TDAR1);
            break;
        case kENET_Ring2:
            txDesActive = &(base->TDAR2);
            break;
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
        default:
            txDesActive = &(base->TDAR);
            break;
    }

