RTEMS/rtems/bsps/arm/imxrt/mcux-sdk/drivers/enet/fsl_enet.c
    /* Clear the MDIO access complete event. */
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);

    /* Starts MDIO write command. */
    ENET_StartSMIWrite(base, phyAddr, regAddr, kENET_MiiWriteValidFrame, data);

    result = ENET_MDIOWaitTransferOver(base);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Clear the MDIO access complete event. */
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);

    return result;
}

/*!
 * @brief MDIO read with IEEE802.3 Clause 22 format.
 *
 * @param base  ENET peripheral base address.
 * @param phyAddr  The PHY address.
 * @param regAddr  The PHY register. Range from 0 ~ 31.
 * @param pData  The data read from PHY.
 * @return kStatus_Success  MDIO access succeeds.
 * @return kStatus_Timeout  MDIO access timeout.
 */
status_t ENET_MDIORead(ENET_Type *base, uint8_t phyAddr, uint8_t regAddr, uint16_t *pData)
{
    assert(pData != NULL);

    status_t result = kStatus_Success;

    /* Clear the MDIO access complete event. */
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);

    /* Starts a MDIO read command operation. */
    ENET_StartSMIRead(base, phyAddr, regAddr, kENET_MiiReadValidFrame);

    result = ENET_MDIOWaitTransferOver(base);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Get received data. */
    *pData = (uint16_t)ENET_ReadSMIData(base);

    /* Clear the MDIO access complete event. */
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);

    return result;
}

#if defined(FSL_FEATURE_ENET_HAS_EXTEND_MDIO) && FSL_FEATURE_ENET_HAS_EXTEND_MDIO
/*!
 * @brief MDIO write with IEEE802.3 Clause 45 format.
 *
 * @param base  ENET peripheral base address.
 * @param portAddr  The MDIO port address(PHY address).
 * @param devAddr  The device address.
 * @param regAddr  The PHY register address.
 * @param data  The data written to PHY.
 * @return kStatus_Success  MDIO access succeeds.
 * @return kStatus_Timeout  MDIO access timeout.
 */
status_t ENET_MDIOC45Write(ENET_Type *base, uint8_t portAddr, uint8_t devAddr, uint16_t regAddr, uint16_t data)
{
    status_t result = kStatus_Success;

    /* Write the register address */
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);
    ENET_StartExtC45SMIWriteReg(base, portAddr, devAddr, regAddr);
    result = ENET_MDIOWaitTransferOver(base);
    if (result != kStatus_Success)
    {
        return result;
    }
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);

    /* Write data to the specified register address */
    ENET_StartExtC45SMIWriteData(base, portAddr, devAddr, data);
    result = ENET_MDIOWaitTransferOver(base);
    if (result != kStatus_Success)
    {
        return result;
    }
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);

    return result;
}
/*!
 * @brief MDIO read with IEEE802.3 Clause 45 format.
 *
 * @param base  ENET peripheral base address.
 * @param portAddr  The MDIO port address(PHY address).
 * @param devAddr  The device address.
 * @param regAddr  The PHY register address.
 * @param pData  The data read from PHY.
 * @return kStatus_Success  MDIO access succeeds.
 * @return kStatus_Timeout  MDIO access timeout.
 */
status_t ENET_MDIOC45Read(ENET_Type *base, uint8_t portAddr, uint8_t devAddr, uint16_t regAddr, uint16_t *pData)
{
    assert(pData != NULL);

    status_t result = kStatus_Success;

    /* Write the register address */
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);
    ENET_StartExtC45SMIWriteReg(base, portAddr, devAddr, regAddr);
    result = ENET_MDIOWaitTransferOver(base);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Read data from the specified register address */
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);
    ENET_StartExtC45SMIReadData(base, portAddr, devAddr);
    result = ENET_MDIOWaitTransferOver(base);
    if (result != kStatus_Success)
    {
        return result;
    }
    ENET_ClearInterruptStatus(base, ENET_EIR_MII_MASK);
    *pData = (uint16_t)ENET_ReadSMIData(base);
    return result;
}
#endif /* FSL_FEATURE_ENET_HAS_EXTEND_MDIO */

static uint16_t ENET_IncreaseIndex(uint16_t index, uint16_t max)
{
    assert(index < max);

    /* Increase the index. */
    index++;
    if (index >= max)
    {
        index = 0;
    }
    return index;
}

static inline bool ENET_TxDirtyRingAvailable(enet_tx_dirty_ring_t *txDirtyRing)
{
    return !txDirtyRing->isFull;
}

/*!
 * brief Gets the error statistics of a received frame for ENET specified ring.
 *
 * This API must be called after the ENET_GetRxFrameSize and before the ENET_ReadFrame().
 * If the ENET_GetRxFrameSize returns kStatus_ENET_RxFrameError,
 * the ENET_GetRxErrBeforeReadFrame can be used to get the exact error statistics.
 * This is an example.
 * code
 *       status = ENET_GetRxFrameSize(&g_handle, &length, 0);
 *       if (status == kStatus_ENET_RxFrameError)
 *       {
 *           ENET_GetRxErrBeforeReadFrame(&g_handle, &eErrStatic, 0);
 *           ENET_ReadFrame(EXAMPLE_ENET, &g_handle, NULL, 0);
 *       }
 * endcode
 * param handle The ENET handler structure pointer. This is the same handler pointer used in the ENET_Init.
 * param eErrorStatic The error statistics structure pointer.
 * param ringId The ring index, range from 0 ~ (FSL_FEATURE_ENET_INSTANCE_QUEUEn(x) - 1).
 */
void ENET_GetRxErrBeforeReadFrame(enet_handle_t *handle, enet_data_error_stats_t *eErrorStatic, uint8_t ringId)
{
    assert(handle != NULL);
    assert(eErrorStatic != NULL);
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_QUEUE);

    uint16_t control                             = 0;
    enet_rx_bd_ring_t *rxBdRing                  = &handle->rxBdRing[ringId];
    volatile enet_rx_bd_struct_t *curBuffDescrip = rxBdRing->rxBdBase + rxBdRing->rxGenIdx;
    volatile enet_rx_bd_struct_t *cmpBuffDescrip = curBuffDescrip;

    do
    {
        /* The last buffer descriptor of a frame. */
        if (0U != (curBuffDescrip->control & ENET_BUFFDESCRIPTOR_RX_LAST_MASK))
        {
            control = curBuffDescrip->control;
            if (0U != (control & ENET_BUFFDESCRIPTOR_RX_TRUNC_MASK))
            {
                /* The receive truncate error. */
                eErrorStatic->statsRxTruncateErr++;
            }
            if (0U != (control & ENET_BUFFDESCRIPTOR_RX_OVERRUN_MASK))
            {
                /* The receive over run error. */
                eErrorStatic->statsRxOverRunErr++;
            }
            if (0U != (control & ENET_BUFFDESCRIPTOR_RX_LENVLIOLATE_MASK))
            {
                /* The receive length violation error. */
                eErrorStatic->statsRxLenGreaterErr++;
            }
            if (0U != (control & ENET_BUFFDESCRIPTOR_RX_NOOCTET_MASK))
            {
                /* The receive alignment error. */
                eErrorStatic->statsRxAlignErr++;
            }
            if (0U != (control & ENET_BUFFDESCRIPTOR_RX_CRC_MASK))
            {
                /* The receive CRC error. */
                eErrorStatic->statsRxFcsErr++;
            }
#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
            uint16_t controlExt = curBuffDescrip->controlExtend1;
            if (0U != (controlExt & ENET_BUFFDESCRIPTOR_RX_MACERR_MASK))
            {
                /* The MAC error. */
                eErrorStatic->statsRxMacErr++;
            }
            if (0U != (controlExt & ENET_BUFFDESCRIPTOR_RX_PHYERR_MASK))
            {
                /* The PHY error. */
                eErrorStatic->statsRxPhyErr++;
            }
            if (0U != (controlExt & ENET_BUFFDESCRIPTOR_RX_COLLISION_MASK))
            {
                /* The receive collision error. */
                eErrorStatic->statsRxCollisionErr++;
            }
#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */

            break;
        }

        /* Increase the buffer descriptor, if it's the last one, increase to first one of the ring buffer. */
        if (0U != (curBuffDescrip->control & ENET_BUFFDESCRIPTOR_RX_WRAP_MASK))
        {
            curBuffDescrip = rxBdRing->rxBdBase;
        }
        else
        {
            curBuffDescrip++;
        }

    } while (curBuffDescrip != cmpBuffDescrip);
}

/*!
 * brief Gets statistical data in transfer.
 *
 * param base  ENET peripheral base address.
 * param statistics The statistics structure pointer.
 */
void ENET_GetStatistics(ENET_Type *base, enet_transfer_stats_t *statistics)
{
    /* Rx statistics */
    statistics->statsRxFrameCount      = base->RMON_R_PACKETS;
    statistics->statsRxFrameOk         = base->IEEE_R_FRAME_OK;
    statistics->statsRxCrcErr          = base->IEEE_R_CRC;
    statistics->statsRxAlignErr        = base->IEEE_R_ALIGN;
    statistics->statsRxDropInvalidSFD  = base->IEEE_R_DROP;
    statistics->statsRxFifoOverflowErr = base->IEEE_R_MACERR;

    /* Tx statistics */
    statistics->statsTxFrameCount      = base->RMON_T_PACKETS;
    statistics->statsTxFrameOk         = base->IEEE_T_FRAME_OK;
    statistics->statsTxCrcAlignErr     = base->RMON_T_CRC_ALIGN;
    statistics->statsTxFifoUnderRunErr = base->IEEE_T_MACERR;
}

/*!
 * brief Gets the size of the read frame for specified ring.
 *
 * This function gets a received frame size from the ENET buffer descriptors.
 * note The FCS of the frame is automatically removed by MAC and the size is the length without the FCS.
 * After calling ENET_GetRxFrameSize, ENET_ReadFrame() should be called to receive frame and update the BD
 * if the result is not "kStatus_ENET_RxFrameEmpty".
 *
 * param handle The ENET handler structure. This is the same handler pointer used in the ENET_Init.
 * param length The length of the valid frame received.
 * param ringId The ring index or ring number.
 * retval kStatus_ENET_RxFrameEmpty No frame received. Should not call ENET_ReadFrame to read frame.
 * retval kStatus_ENET_RxFrameError Data error happens. ENET_ReadFrame should be called with NULL data
 *         and NULL length to update the receive buffers.
 * retval kStatus_Success Receive a frame Successfully then the ENET_ReadFrame
 *         should be called with the right data buffer and the captured data length input.
 */
status_t ENET_GetRxFrameSize(enet_handle_t *handle, uint32_t *length, uint8_t ringId)
{
    assert(handle != NULL);
    assert(length != NULL);
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_QUEUE);

    /* Reset the length to zero. */
    *length = 0;

