RTEMS/rtems/bsps/arm/imxrt/mcux-sdk/drivers/enet/fsl_enet.c
#if defined(ENET2)
void ENET2_DriverIRQHandler(void);
void ENET2_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(ENET2);
    SDK_ISR_EXIT_BARRIER;
}

void ENET2_1588_Timer_DriverIRQHandler(void);
void ENET2_1588_Timer_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(ENET2);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENET2 */

#if defined(CONNECTIVITY__ENET0)
void CONNECTIVITY_ENET0_FRAME0_EVENT_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_FRAME0_EVENT_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(CONNECTIVITY__ENET0);
    SDK_ISR_EXIT_BARRIER;
}
#if FSL_FEATURE_ENET_QUEUE > 1
void CONNECTIVITY_ENET0_FRAME1_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_FRAME1_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame1IRQHandler(CONNECTIVITY__ENET0);
    SDK_ISR_EXIT_BARRIER;
}
void CONNECTIVITY_ENET0_FRAME2_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_FRAME2_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame2IRQHandler(CONNECTIVITY__ENET0);
    SDK_ISR_EXIT_BARRIER;
}
void CONNECTIVITY_ENET0_TIMER_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_TIMER_INT_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(CONNECTIVITY__ENET0);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
#endif /* CONNECTIVITY__ENET0 */
#if defined(CONNECTIVITY__ENET1)
void CONNECTIVITY_ENET1_FRAME0_EVENT_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_FRAME0_EVENT_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(CONNECTIVITY__ENET1);
    SDK_ISR_EXIT_BARRIER;
}
#if FSL_FEATURE_ENET_QUEUE > 1
void CONNECTIVITY_ENET1_FRAME1_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_FRAME1_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame1IRQHandler(CONNECTIVITY__ENET1);
    SDK_ISR_EXIT_BARRIER;
}
void CONNECTIVITY_ENET1_FRAME2_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_FRAME2_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame2IRQHandler(CONNECTIVITY__ENET1);
    SDK_ISR_EXIT_BARRIER;
}
void CONNECTIVITY_ENET1_TIMER_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_TIMER_INT_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(CONNECTIVITY__ENET1);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
#endif /* CONNECTIVITY__ENET1 */
#if FSL_FEATURE_ENET_QUEUE > 1
#if defined(ENET_1G)
void ENET_1G_DriverIRQHandler(void);
void ENET_1G_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(ENET_1G);
    SDK_ISR_EXIT_BARRIER;
}
void ENET_1G_MAC0_Tx_Rx_1_DriverIRQHandler(void);
void ENET_1G_MAC0_Tx_Rx_1_DriverIRQHandler(void)
{
    ENET_CommonFrame1IRQHandler(ENET_1G);
    SDK_ISR_EXIT_BARRIER;
}
void ENET_1G_MAC0_Tx_Rx_2_DriverIRQHandler(void);
void ENET_1G_MAC0_Tx_Rx_2_DriverIRQHandler(void)
{
    ENET_CommonFrame2IRQHandler(ENET_1G);
    SDK_ISR_EXIT_BARRIER;
}
void ENET_1G_1588_Timer_DriverIRQHandler(void);
void ENET_1G_1588_Timer_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(ENET_1G);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENET_1G */

#if defined(ENET1)
void ENET1_MAC0_Rx_Tx_Done1_DriverIRQHandler(void);
void ENET1_MAC0_Rx_Tx_Done1_DriverIRQHandler(void)
{
    ENET_CommonFrame1IRQHandler(ENET1);
    SDK_ISR_EXIT_BARRIER;
}
void ENET1_MAC0_Rx_Tx_Done2_DriverIRQHandler(void);
void ENET1_MAC0_Rx_Tx_Done2_DriverIRQHandler(void)
{
    ENET_CommonFrame2IRQHandler(ENET1);
    SDK_ISR_EXIT_BARRIER;
}
void ENET1_1588_Timer_DriverIRQHandler(void);
void ENET1_1588_Timer_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(ENET1);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENET1 */
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */